# SpaceOccupancyScheduleParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpaceOccupancyScheduleParam Property
ParameterTypeId Class See Also
---
"Occupancy Schedule"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpaceOccupancyScheduleParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceOccupancyScheduleParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpaceOccupancyScheduleParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace